Autodesk.Revit.DB.SketchPlane.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Creates a sketch plane from a grid, reference plane, or level.
document:
The document.
datumId:
The id of the grid, reference plane, or level.
Returns:
The newly created sketch plane.
Throws Autodesk.Revit.Exceptions.ArgumentException:
datumId is not a valid Element identifier.
-or-
ElementId must correspond to a grid, reference plane, or level.
-or-
ElementId must correspond to a non-curved datum.
-or-
Sketch plane creation is not allowed in this family.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2014

Autodesk.Revit.DB.SketchPlane.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Reference)
Creates a new sketch plane from a reference to a planar face.
Remarks:
A reference relationship will be created between the face and the sketch plane.
document:
The document.
planarFaceReference:
The reference of the planar face where the sketch plane will be created.
Returns:
The newly created sketch plane.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Sketch plane creation is not allowed in this family.
-or-
The reference is not a planar face.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2014

Autodesk.Revit.DB.SketchPlane.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Plane)
Creates a new sketch plane from a geometric plane.
Remarks:
There will not be a reference relationship established from the sketch plane to the input face. To create a SketchPlane with a reference to other geometry,
use the overload with a Reference input.
document:
The document.
plane:
The geometry plane where the sketch plane will be created.
Returns:
The newly created sketch plane.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Sketch plane creation is not allowed in this family.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2014